In [1]:
import pandas as pd
import matplotlib as plt

<h1>Times Data<h1>

In [2]:
timesData = pd.read_csv("timesData.csv")

In [3]:
timesData.describe()

          teaching     research    citations  student_staff_ratio         year
count  2603.000000  2603.000000  2603.000000          2544.000000  2603.000000
mean     37.801498    35.910257    60.921629            18.445283  2014.075682
std      17.604218    21.254805    23.073219            11.458698     1.685733
min       9.900000     2.900000     1.200000             0.600000  2011.000000
25%      24.700000    19.600000    45.500000            11.975000  2013.000000
50%      33.900000    30.500000    62.500000            16.100000  2014.000000
75%      46.400000    47.250000    79.050000            21.500000  2016.000000
max      99.700000    99.400000   100.000000           162.600000  2016.000000

In [8]:
timesData.head(3)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011

In [7]:
timesData['year'].value_counts()

2016    800
2012    402
2015    401
2013    400
2014    400
2011    200
Name: year, dtype: int64

In [9]:
timesData[timesData['university_name'] == 'Harvard University']

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
201,2,Harvard University,United States of America,95.8,67.5,97.4,99.8,35.9,93.9,"20,152",8.9,25%,NaN,2012
605,4,Harvard University,United States of America,94.9,63.7,98.6,99.2,39.9,93.6,"20,152",8.9,25%,NaN,2013
1003,2,Harvard University,United States of America,95.3,66.2,98.5,99.1,40.6,93.9,"20,152",8.9,25%,NaN,2014
1403,2,Harvard University,United States of America,92.9,67.6,98.6,98.9,44.0,93.3,"20,152",8.9,25%,NaN,2015
1808,6,Harvard University,United States of America,83.6,77.2,99.0,99.8,45.2,91.6,"20,152",8.9,25%,NaN,2016

In [20]:
timesData.isna().sum()

world_rank                  0
university_name             0
country                     0
teaching                    0
international               0
research                    0
citations                   0
income                      0
total_score                 0
num_students               59
student_staff_ratio        59
international_students     67
female_male_ratio         233
year                        0
dtype: int64

<h1> Shanghai Data<h1>

In [21]:
shData = pd.read_csv('shanghaiData.csv')

In [22]:
shData.head(3)

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005

In [25]:
shData[shData['university_name'] == 'Federal University of Minas Gerais']

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
1413,403-510,Federal University of Minas Gerais,4,NaN,0.0,0.0,0.0,6.8,30.9,14.3,2007
1824,303-401,Federal University of Minas Gerais,3-4,NaN,0.0,0.0,7.3,6.6,31.8,15.3,2008
2328,303-401,Federal University of Minas Gerais,3-4,NaN,0.0,0.0,7.3,6.6,33.0,15.8,2009
2825,301-400,Federal University of Minas Gerais,3-5,NaN,0.0,0.0,7.2,5.8,36.6,16.5,2010
3327,301-400,Federal University of Minas Gerais,3-5,NaN,0.0,0.0,7.2,5.5,35.6,16.9,2011
4213,301-400,Federal University of Minas Gerais,2-5,NaN,0.0,0.0,3.6,4.9,37.9,17.9,2014
4816,401-500,Federal University of Minas Gerais,5-6,NaN,0.0,0.0,3.6,4.4,37.0,18.3,2015

In [26]:
shData['year'].value_counts()

2007    510
2008    503
2009    501
2015    500
2011    500
2014    500
2010    500
2006    500
2005    500
2012    284
2013     99
Name: year, dtype: int64

<h1> CWUR Data <h1>

In [28]:
cwData = pd.read_csv('cwurData.csv')

In [29]:
cwData.head(3)

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012

In [30]:
cwData['year'].value_counts()

2015    1000
2014    1000
2013     100
2012     100
Name: year, dtype: int64